---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelLength
source: html/098b7ab1-43c6-3b4c-603e-0a92253157f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelLength Property

"Length": The length of Analytical Model

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelLength { get; }
```